插入模式 
a	在光标所在字符后插入
A	在光标所在的行尾插入
i	在光标所在字符前插入
I	在光标所在行行首插入
o	在光标下插入新行
O	在光标上插入新行

:set nu	设置行号
:set nonu 	取消行号
gg		到第一行
G		到最后一行
nG		到第n行
:n		到第n行
$		移至行尾
0		移至行首

删除命令
x		删除光标所在处字符
nx		删除光标所在处后n个字符
dd		删除光标所在行，ndd删除n行
dG		删除光标所在行到文件末尾内容（G代表末尾）
D		删除光标所在处到行尾内容
:n1,n2d	删除指定范围的行

复制命令
yy		复制当前行
nyy		复制当前行以下n行
dd		剪切当前行
ndd		剪切当前行以下n行
p		粘贴在当前光标所在行下
P		粘贴在当前光标所在行上

替换和取消命令
r		取代光标所在处字符
R		从光标所在处开始替换字符，按ESC结束
u		取消上一步操作

搜索和搜索替换命令
/string 	搜索指定字符串
:set ic	搜索时忽略大小写
n		搜索指定字符串的下一个出现
:%s/old/new/g	全文替换指定字符串
:n1,n2s/old/new/g	在一定范围内替换指定字符串


保存和退出命令
:w		保存修改
:w 新文件名	另存为指定文件
:wq		保存并退出
ZZ		快捷键，保存修改并退出 
:q!		不保存退出
:wq!		保存修改并退出（文件所有者及root可使用）
